Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ_EF_DFP/1.0.28/edc/PIC32MZ1024EFG100.PIC
      <edc:SFRDef edc:_addr="0x1F860540" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="ODCF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="ODCF" edc:nzwidth="0x20" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ODCF0" edc:desc="" edc:mask="0x1" edc:name="ODCF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF1" edc:desc="" edc:mask="0x1" edc:name="ODCF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF2" edc:desc="" edc:mask="0x1" edc:name="ODCF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF3" edc:desc="" edc:mask="0x1" edc:name="ODCF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF4" edc:desc="" edc:mask="0x1" edc:name="ODCF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ODCF5" edc:desc="" edc:mask="0x1" edc:name="ODCF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF8" edc:desc="" edc:mask="0x1" edc:name="ODCF8" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ODCF12" edc:desc="" edc:mask="0x1" edc:name="ODCF12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="ODCF13" edc:desc="" edc:mask="0x1" edc:name="ODCF13" edc:nzwidth="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860550" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNPUF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="CNPUF" edc:nzwidth="0x20" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPUF0" edc:desc="" edc:mask="0x1" edc:name="CNPUF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF1" edc:desc="" edc:mask="0x1" edc:name="CNPUF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF2" edc:desc="" edc:mask="0x1" edc:name="CNPUF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF3" edc:desc="" edc:mask="0x1" edc:name="CNPUF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF4" edc:desc="" edc:mask="0x1" edc:name="CNPUF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF5" edc:desc="" edc:mask="0x1" edc:name="CNPUF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF8" edc:desc="" edc:mask="0x1" edc:name="CNPUF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPUF12" edc:desc="" edc:mask="0x1" edc:name="CNPUF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPUF13" edc:desc="" edc:mask="0x1" edc:name="CNPUF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860560" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNPDF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="CNPDF" edc:nzwidth="0x20" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNPDF0" edc:desc="" edc:mask="0x1" edc:name="CNPDF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF1" edc:desc="" edc:mask="0x1" edc:name="CNPDF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF2" edc:desc="" edc:mask="0x1" edc:name="CNPDF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF3" edc:desc="" edc:mask="0x1" edc:name="CNPDF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF4" edc:desc="" edc:mask="0x1" edc:name="CNPDF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF5" edc:desc="" edc:mask="0x1" edc:name="CNPDF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF8" edc:desc="" edc:mask="0x1" edc:name="CNPDF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNPDF12" edc:desc="" edc:mask="0x1" edc:name="CNPDF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNPDF13" edc:desc="" edc:mask="0x1" edc:name="CNPDF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860570" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="----------------n---n-----------" edc:cname="CNCONF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff9fff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------0---0-----------" edc:name="CNCONF" edc:nzwidth="0x20" edc:por="----------------0---0-----------" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0xb"/>
            <edc:SFRFieldDef edc:cname="EDGEDETECT" edc:mask="0x1" edc:name="EDGEDETECT" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ON" edc:desc="" edc:mask="0x1" edc:name="ON" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:FreezeBit edc:freezeval="1" edc:name="CHANGE NOTICE F" edc:pos="14"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860580" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNENF" edc:desc="" edc:grp="PORTF" edc:impl="0xffc0313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="CNENF" edc:nzwidth="0x20" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNIEF0" edc:desc="" edc:mask="0x1" edc:name="CNIEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF1" edc:desc="" edc:mask="0x1" edc:name="CNIEF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF2" edc:desc="" edc:mask="0x1" edc:name="CNIEF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF3" edc:desc="" edc:mask="0x1" edc:name="CNIEF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF4" edc:desc="" edc:mask="0x1" edc:name="CNIEF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF5" edc:desc="" edc:mask="0x1" edc:name="CNIEF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF8" edc:desc="" edc:mask="0x1" edc:name="CNIEF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNIEF12" edc:desc="" edc:mask="0x1" edc:name="CNIEF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNIEF13" edc:desc="" edc:mask="0x1" edc:name="CNIEF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860590" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNSTATF" edc:desc="" edc:grp="PORTF" edc:impl="0xffff313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="CNSTATF" edc:nzwidth="0x20" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNSTATF0" edc:desc="" edc:mask="0x1" edc:name="CNSTATF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF1" edc:desc="" edc:mask="0x1" edc:name="CNSTATF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF2" edc:desc="" edc:mask="0x1" edc:name="CNSTATF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF3" edc:desc="" edc:mask="0x1" edc:name="CNSTATF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF4" edc:desc="" edc:mask="0x1" edc:name="CNSTATF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF5" edc:desc="" edc:mask="0x1" edc:name="CNSTATF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF8" edc:desc="" edc:mask="0x1" edc:name="CNSTATF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF12" edc:desc="" edc:mask="0x1" edc:name="CNSTATF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNSTATF13" edc:desc="" edc:mask="0x1" edc:name="CNSTATF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8605A0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNNEF" edc:desc="" edc:impl="0x313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="CNNEF" edc:nzwidth="32" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNNEF0" edc:mask="0x1" edc:name="CNNEF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF1" edc:mask="0x1" edc:name="CNNEF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF2" edc:mask="0x1" edc:name="CNNEF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF3" edc:mask="0x1" edc:name="CNNEF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF4" edc:mask="0x1" edc:name="CNNEF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF5" edc:mask="0x1" edc:name="CNNEF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEF8" edc:mask="0x1" edc:name="CNNEF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNNEF12" edc:mask="0x1" edc:name="CNNEF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNNEF13" edc:mask="0x1" edc:name="CNNEF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8605B0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------nn---n--nnnnnn" edc:cname="CNFF" edc:desc="" edc:impl="0x313f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------00---0--000000" edc:name="CNFF" edc:nzwidth="32" edc:por="------------------00---0--000000" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CNFF0" edc:mask="0x1" edc:name="CNFF0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF1" edc:mask="0x1" edc:name="CNFF1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF2" edc:mask="0x1" edc:name="CNFF2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF3" edc:mask="0x1" edc:name="CNFF3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF4" edc:mask="0x1" edc:name="CNFF4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF5" edc:mask="0x1" edc:name="CNFF5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFF8" edc:mask="0x1" edc:name="CNFF8" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="CNFF12" edc:mask="0x1" edc:name="CNFF12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CNFF13" edc:mask="0x1" edc:name="CNFF13" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8605C0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------------------nn" edc:cname="SRCON0F" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SRCON0F" edc:nzwidth="32" edc:por="------------------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR0F0" edc:mask="0x1" edc:name="SR0F0" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="SR0F1" edc:mask="0x1" edc:name="SR0F1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8605D0" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="6" edc:access="------------------------------nn" edc:cname="SRCON1F" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------------------------------00" edc:name="SRCON1F" edc:nzwidth="32" edc:por="------------------------------00" edc:portals="CLR SET INV" ltx:memberofperipheral="PORTF">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="SR1F0" edc:mask="0x1" edc:name="SR1F0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SR1F1" edc:mask="0x1" edc:name="SR1F1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F8605E0" edc:offset="0x20"/>
      <edc:SFRDef edc:_addr="0x1F860600" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------n-----nnnn------" edc:cname="ANSELG" edc:desc="" edc:grp="PORTG" edc:impl="0xffff83c0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1-----1111------" edc:name="ANSELG" edc:nzwidth="0x20" edc:por="----------------1-----1111------" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG6" edc:desc="" edc:mask="0x1" edc:name="ANSG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG7" edc:desc="" edc:mask="0x1" edc:name="ANSG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG8" edc:desc="" edc:mask="0x1" edc:name="ANSG8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANSG9" edc:desc="" edc:mask="0x1" edc:name="ANSG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANSG15" edc:desc="" edc:mask="0x1" edc:name="ANSG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x0" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F860610" edc:_begin="0x0" edc:_end="0xe0" edc:_modsrc="DOS-02467_gpio_ports_upb_v1.Module" edc:_refcount="7" edc:access="----------------nnnn--nnnn----nn" edc:cname="TRISG" edc:desc="" edc:grp="PORTG" edc:impl="0xfffff3c3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------------1111--1111----11" edc:name="TRISG" edc:nzwidth="0x20" edc:por="----------------1111--1111----11" edc:portals="CLR SET INV">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="TRISG0" edc:desc="" edc:mask="0x1" edc:name="TRISG0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG1" edc:desc="" edc:mask="0x1" edc:name="TRISG1" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISG6" edc:desc="" edc:mask="0x1" edc:name="TRISG6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG7" edc:desc="" edc:mask="0x1" edc:name="TRISG7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG8" edc:desc="" edc:mask="0x1" edc:name="TRISG8" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG9" edc:desc="" edc:mask="0x1" edc:name="TRISG9" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="TRISG12" edc:desc="" edc:mask="0x1" edc:name="TRISG12" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG13" edc:desc="" edc:mask="0x1" edc:name="TRISG13" edc:nzwidth="1"/>
            <edc:SFRFieldDef edc:cname="TRISG14" edc:desc="" edc:mask="0x1" edc:name="TRISG14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TRISG15" edc:desc="" edc:mask="0x1" edc:name="TRISG15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
        <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
      </edc:SFRDef>
